///////////////////////////////////////////////
//  Просмотр списка записанных файлов на CD  //
//                                           //
// ©	Дмитрий Хмелев                         //
///////////////////////////////////////////////

module.exports = async function(param){

/*****************************/
/*** Подключение библиотек ***/
/*****************************/
var request = require('request');
/*****************************/

  var url = 'http://172.22.1.16/content';

  request.get({url:url}, (err) =>{ if (err) return console.error(err);})
  .pipe(process.stdout)
}