//////////////////////////////////////////////////
// Уведомление о неотправленных сообщений в ФНС //
//                                              //
// ©	Дмитрий Хмелев                            //
//////////////////////////////////////////////////

module.exports = async function(param, system){

/*****************************/
/*** Подключение библиотек ***/
/*****************************/
var moment = require('moment'),
    ibso = require('synapse/ibso')(system.config.ibs);
/*****************************/

/////////////////////////////////////////////
/////// если запущено из Планировщика ///////
/////////////////////////////////////////////
  if (!param.task.user) {
    // завершаем, если сегодня нет ОД
    if (!await ibso.existOD(moment()))
      process.exit(2);
  }
/////////////////////////////////////////////

  ibso.query(`SELECT 
              	PERS.C_1 as FIO,
              	OTP.C_3 as BEGIN,
              	OTP.C_4 as END 
              FROM 
              	IBS.VW_CRIT_KADR_SPIS PERS,
              	IBS.VW_CRIT_LEAVE_FULL OTP 
              WHERE 
              	OTP.COLLECTION_ID = PERS.REF14 
              	AND PERS.C_2 like '002-00%' 
              	AND OTP.C_3 <= SYSDATE+30
              	AND OTP.C_4 >= SYSDATE
              	AND OTP.C_4-OTP.C_3 < 100 
--              	AND OTP.C_4 <> OTP.C_3 
              	AND PERS.C_1 in ( 'Захарова Марина Николаевна',
              										'Удодова Елена Александровна',
              										'Вахрушкина Татьяна Геннадьевна',
              										'Ротаенко Олег Владимирович',
              										'Нестерова Наталья Маратовна',
              										'Савельева Олеся Васильевна',
              										'Колесникова Валентина Владимировна',
              										'Павлова Мария Леонидовна',
              										'Майгур Владимир Владимирович',
              										'Шишкин Борис Анатольевич',
              										'Молибогов Константин Владимирович',
              										'Пронина Светлана Юрьевна',
              										'Димурина Татьяна Леонидовна',
              										'Любященко Виталий Валерьевич',
              										'Прудников Сергей Владимирович',
              										'Афанасьев Андрей Николаевич',
              										'Крылов Виктор Владимирович',
              										'Журавков Александр Викторович'
              									)
              ORDER BY 
                OTP.C_3`)
  .then(rs  => {
    if (rs && rs.length) 
      console.log(rs.reduce((all, el) => all + el.BEGIN + "   " + el.END + "   " + el.FIO + "\r\n", ""));
    else {
      if (!param.task.user) 
        process.exit(2);
      console.log('Все на работе!');
    }
  });
}